app/views/articles/showcategoryarticles.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = $1  [["category_id", nil]]
---
<div class="row article">
	<% @category.articles.each do |article| %>