app/views/articles/show.html.erb

		<h5>Comments</h5>
		<% if @article.comments.empty? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 2]]