app/views/users/index.html.erb

				<div class="col-md-3">
					<%= f.select :role, User.roles.keys.to_a, :selected => user.role %>
---
SELECT "users".* FROM "users"