app/controllers/articles_controller.rb

SELECT "categories".* FROM "categories"
---
	def new
		@article = Article.new
		@category = Category.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
	def edit
		@article = Article.find(params[:id])
		@category = Category.all

SELECT "categories".* FROM "categories"
INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "titel"], ["text", "text"], ["created_at", "2018-10-25 10:51:27.916959"], ["updated_at", "2018-10-25 10:51:27.916959"], ["category_id", 1]]
---
	def create
		@article = Article.new(article_params)
		@category = Category.all
	 	if @article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "articles" SET "title" = $1, "text" = $2, "category_id" = $3, "updated_at" = $4 WHERE "articles"."id" = $5  [["title", "nepals"], ["text", "some texts"], ["category_id", 7], ["updated_at", "2018-10-26 04:17:02.106780"], ["id", 31]]
---
	def update
		@article = Article.find(params[:id])
		# @category = Category.all
		if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
	def destroy
	    @article = Article.find(params[:id])
	    authorize @article
	    @article.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  	def showcategoryarticles
  		@category = Category.find(params[:category_id])