app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
	def index
		@category = Category.all

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "sportss"], ["updated_at", "2018-10-25 09:55:30.739709"], ["id", 2]]
---
  	def update
		@category = Category.find(params[:id]);
		if @category.update(category_params)