app/controllers/sessions_controller.rb

	def create
		reset_session
		@user = User.find_by(email: session_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "asmit@test.com"], ["LIMIT", 1]]