app/controllers/users_controller.rb

    def update
      @user = User.find(params[:id])
      # @category = Category.all
      # authorize @user
      if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "role" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["role", 1], ["updated_at", "2018-10-29 10:35:55.204289"], ["id", 1]]